In [1]:
from pyspark.sql import SparkSession

spark = SparkSession \
    .builder \
    .appName("Titanic SQL Example") \
    .getOrCreate()

### Read the data first

In [2]:
spark.read.csv("data/Titanic_data.csv")

DataFrame[_c0: string, _c1: string, _c2: string, _c3: string, _c4: string, _c5: string]

In [3]:
t_raw_data = spark.read.csv("data/Titanic_data.csv",header=True,inferSchema=True,)
t_raw_data

DataFrame[id: int, PClass: string, Age: double, Sex: string, Survived: int, SexCode: int]

### Start exploring the data

In [4]:
# See how the data looks like
t_raw_data.show()
# Pclass: Passenger Class
# Survived either 1 or 0
# GenderCode 1 for female, 0 for male

+---+------+----+------+--------+-------+
| id|PClass| Age|   Sex|Survived|SexCode|
+---+------+----+------+--------+-------+
|  1|   1st|29.0|female|       1|      1|
|  2|   1st| 2.0|female|       0|      1|
|  3|   1st|30.0|  male|       0|      0|
|  4|   1st|25.0|female|       0|      1|
|  5|   1st|0.92|  male|       1|      0|
|  6|   1st|47.0|  male|       1|      0|
|  7|   1st|63.0|female|       1|      1|
|  8|   1st|39.0|  male|       0|      0|
|  9|   1st|58.0|female|       1|      1|
| 10|   1st|71.0|  male|       0|      0|
| 11|   1st|47.0|  male|       0|      0|
| 12|   1st|19.0|female|       1|      1|
| 13|   1st| 0.0|female|       1|      1|
| 14|   1st| 0.0|  male|       1|      0|
| 15|   1st| 0.0|  male|       0|      0|
| 16|   1st|50.0|female|       1|      1|
| 17|   1st|24.0|  male|       0|      0|
| 18|   1st|36.0|  male|       0|      0|
| 19|   1st|37.0|  male|       1|      0|
| 20|   1st|47.0|female|       1|      1|
+---+------+----+------+--------+-------+
only showing top 20 rows

In [5]:
t_raw_data.count()

1313

In [6]:
# Print the schema
t_raw_data.printSchema()

root
 |-- id: integer (nullable = true)
 |-- PClass: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Survived: integer (nullable = true)
 |-- SexCode: integer (nullable = true)

In [7]:
# Describe the data
t_raw_data.describe().show()

+-------+-----------------+------+------------------+------+-------------------+-------------------+
|summary|               id|PClass|               Age|   Sex|           Survived|            SexCode|
+-------+-----------------+------+------------------+------+-------------------+-------------------+
|  count|             1313|  1313|              1313|  1313|               1313|               1313|
|   mean|            657.0|  null|17.502574257425742|  null| 0.3427265803503427| 0.3518659558263519|
| stddev|379.1747618183468|  null| 18.51694476332819|  null|0.47480181908910607|0.47773437008438874|
|    min|                1|     *|               0.0|female|                  0|                  0|
|    max|             1313|   3rd|              71.0|  male|                  1|                  1|
+-------+-----------------+------+------------------+------+-------------------+-------------------+

In [8]:
t_names = spark.read.csv("data/Titanic_names.csv",header=True,inferSchema=True,)
t_names

DataFrame[id: int, Name: string]

In [10]:
t_names.show()

+---+--------------------+
| id|                Name|
+---+--------------------+
|  1|Allen, Miss Elisa...|
|  2|Allison, Miss Hel...|
|  3|Allison, Mr Hudso...|
|  4|Allison, Mrs Huds...|
|  5|Allison, Master H...|
|  6|  Anderson, Mr Harry|
|  7|Andrews, Miss Kor...|
|  8|Andrews, Mr Thoma...|
|  9|Appleton, Mrs Edw...|
| 10|Artagaveytia, Mr ...|
| 11|Astor, Colonel Jo...|
| 12|Astor, Mrs John J...|
| 13|Aubert, Mrs Leont...|
| 14|Barkworth, Mr Alg...|
| 15|  Baumann, Mr John D|
| 16|Baxter, Mrs James...|
| 17|Baxter, Mr Quigg ...|
| 18| Beattie, Mr Thomson|
| 19|Beckwith, Mr Rich...|
| 20|Beckwith, Mrs Ric...|
+---+--------------------+
only showing top 20 rows

### Sanitize the data

In [14]:
# Try to remove the 0.0 from the age column
t_data = t_raw_data.filter(t_raw_data.Age > 0)

In [17]:
t_data.show()

+---+------+----+------+--------+-------+
| id|PClass| Age|   Sex|Survived|SexCode|
+---+------+----+------+--------+-------+
|  1|   1st|29.0|female|       1|      1|
|  2|   1st| 2.0|female|       0|      1|
|  3|   1st|30.0|  male|       0|      0|
|  4|   1st|25.0|female|       0|      1|
|  5|   1st|0.92|  male|       1|      0|
|  6|   1st|47.0|  male|       1|      0|
|  7|   1st|63.0|female|       1|      1|
|  8|   1st|39.0|  male|       0|      0|
|  9|   1st|58.0|female|       1|      1|
| 10|   1st|71.0|  male|       0|      0|
| 11|   1st|47.0|  male|       0|      0|
| 12|   1st|19.0|female|       1|      1|
| 16|   1st|50.0|female|       1|      1|
| 17|   1st|24.0|  male|       0|      0|
| 18|   1st|36.0|  male|       0|      0|
| 19|   1st|37.0|  male|       1|      0|
| 20|   1st|47.0|female|       1|      1|
| 21|   1st|26.0|  male|       1|      0|
| 22|   1st|25.0|  male|       0|      0|
| 23|   1st|25.0|  male|       1|      0|
+---+------+----+------+--------+-------+
only showing top 20 rows

In [18]:
t_data.count()

756

In [19]:
t_data.describe().show()

+-------+------------------+------+------------------+------+------------------+-------------------+
|summary|                id|PClass|               Age|   Sex|          Survived|            SexCode|
+-------+------------------+------+------------------+------+------------------+-------------------+
|  count|               756|   756|               756|   756|               756|                756|
|   mean| 520.5489417989418|  null|30.397989417989415|  null| 0.414021164021164|0.38095238095238093|
| stddev|318.61611186598935|  null|14.259048710359023|  null|0.4928782551360203| 0.4859424028848232|
|    min|                 1|   1st|              0.17|female|                 0|                  0|
|    max|              1313|   3rd|              71.0|  male|                 1|                  1|
+-------+------------------+------+------------------+------+------------------+-------------------+

### Start SQL Queries on the dataframe

In [27]:
# Create a temporary view in order to use SQL queries
t_data.createOrReplaceTempView('titanic_data')

In [21]:
# Show only survivors
survivors = spark.sql("SELECT * FROM titanic_data WHERE survived = 1")
survivors.show()
survivors.count()

+---+------+----+------+--------+-------+
| id|PClass| Age|   Sex|Survived|SexCode|
+---+------+----+------+--------+-------+
|  1|   1st|29.0|female|       1|      1|
|  5|   1st|0.92|  male|       1|      0|
|  6|   1st|47.0|  male|       1|      0|
|  7|   1st|63.0|female|       1|      1|
|  9|   1st|58.0|female|       1|      1|
| 12|   1st|19.0|female|       1|      1|
| 16|   1st|50.0|female|       1|      1|
| 19|   1st|37.0|  male|       1|      0|
| 20|   1st|47.0|female|       1|      1|
| 21|   1st|26.0|  male|       1|      0|
| 23|   1st|25.0|  male|       1|      0|
| 24|   1st|19.0|female|       1|      1|
| 25|   1st|28.0|  male|       1|      0|
| 27|   1st|39.0|  male|       1|      0|
| 28|   1st|30.0|female|       1|      1|
| 29|   1st|58.0|female|       1|      1|
| 31|   1st|45.0|female|       1|      1|
| 32|   1st|22.0|female|       1|      1|
| 37|   1st|44.0|female|       1|      1|
| 38|   1st|59.0|female|       1|      1|
+---+------+----+------+--------+-------+
only showing top 20 rows

313

In [33]:
# Show only female survivors
females = spark.sql("SELECT * FROM titanic_data WHERE Sex = 'female' AND Survived=1")
females.show()
females.count()

+---+------+----+------+--------+-------+
| id|PClass| Age|   Sex|Survived|SexCode|
+---+------+----+------+--------+-------+
|  1|   1st|29.0|female|       1|      1|
|  7|   1st|63.0|female|       1|      1|
|  9|   1st|58.0|female|       1|      1|
| 12|   1st|19.0|female|       1|      1|
| 16|   1st|50.0|female|       1|      1|
| 20|   1st|47.0|female|       1|      1|
| 24|   1st|19.0|female|       1|      1|
| 28|   1st|30.0|female|       1|      1|
| 29|   1st|58.0|female|       1|      1|
| 31|   1st|45.0|female|       1|      1|
| 32|   1st|22.0|female|       1|      1|
| 37|   1st|44.0|female|       1|      1|
| 38|   1st|59.0|female|       1|      1|
| 39|   1st|60.0|female|       1|      1|
| 42|   1st|53.0|female|       1|      1|
| 43|   1st|58.0|female|       1|      1|
| 49|   1st|36.0|female|       1|      1|
| 50|   1st|14.0|female|       1|      1|
| 57|   1st|47.0|female|       1|      1|
| 59|   1st|31.0|female|       1|      1|
+---+------+----+------+--------+-------+
only showing top 20 rows

217

In [46]:
# List different types of passenger classes
dfclass = spark.sql("select distinct(Pclass) from titanic_data").show()

+------+
|Pclass|
+------+
|   2nd|
|   1st|
|   3rd|
+------+

In [74]:
# List number of people in each passenger class
dfclass_counts = spark.sql("select pclass, count(Pclass) as pclass_count from titanic_data group by Pclass")
dfclass_counts.show()

+------+------------+
|pclass|pclass_count|
+------+------------+
|   2nd|         212|
|   1st|         226|
|   3rd|         318|
+------+------------+

In [75]:
dfclass_survived = spark.sql("select pclass, count(Pclass) as survived_count from titanic_data where survived=1 group by Pclass")
dfclass_survived.show()

+------+--------------+
|pclass|survived_count|
+------+--------------+
|   2nd|            96|
|   1st|           139|
|   3rd|            78|
+------+--------------+

#### Using dataframe functions

In [76]:
# but use 't_raw_data' dataframe to compare with original data
t_raw_data.filter(t_raw_data.Survived == 1).filter(t_raw_data.Age > 0).groupby("pclass").count().show()

+------+-----+
|pclass|count|
+------+-----+
|   2nd|   96|
|   1st|  139|
|   3rd|   78|
+------+-----+

In [77]:
# display the list of number of people in each passenger class & list of number of survivors in each passenger class,
# as a single dataframe
dfclass_joined = dfclass_counts.join(dfclass_survived, "pclass")
dfclass_joined.show()

+------+------------+--------------+
|pclass|pclass_count|survived_count|
+------+------------+--------------+
|   2nd|         212|            96|
|   1st|         226|           139|
|   3rd|         318|            78|
+------+------------+--------------+

In [78]:
dfclass_joined.select("pclass", dfclass_joined["survived_count"]/dfclass_joined["pclass_count"]).show()

+------+-------------------------------+
|pclass|(survived_count / pclass_count)|
+------+-------------------------------+
|   2nd|             0.4528301886792453|
|   1st|             0.6150442477876106|
|   3rd|            0.24528301886792453|
+------+-------------------------------+

#### Get the names

In [125]:
t_names.createOrReplaceTempView("titanic_names")
t_names.show()

+---+--------------------+
| id|                Name|
+---+--------------------+
|  1|Allen, Miss Elisa...|
|  2|Allison, Miss Hel...|
|  3|Allison, Mr Hudso...|
|  4|Allison, Mrs Huds...|
|  5|Allison, Master H...|
|  6|  Anderson, Mr Harry|
|  7|Andrews, Miss Kor...|
|  8|Andrews, Mr Thoma...|
|  9|Appleton, Mrs Edw...|
| 10|Artagaveytia, Mr ...|
| 11|Astor, Colonel Jo...|
| 12|Astor, Mrs John J...|
| 13|Aubert, Mrs Leont...|
| 14|Barkworth, Mr Alg...|
| 15|  Baumann, Mr John D|
| 16|Baxter, Mrs James...|
| 17|Baxter, Mr Quigg ...|
| 18| Beattie, Mr Thomson|
| 19|Beckwith, Mr Rich...|
| 20|Beckwith, Mrs Ric...|
+---+--------------------+
only showing top 20 rows

In [127]:
t_joined_df = t_names.join(t_raw_data, 'id')
t_joined_df.show()

+---+--------------------+------+----+------+--------+-------+
| id|                Name|PClass| Age|   Sex|Survived|SexCode|
+---+--------------------+------+----+------+--------+-------+
|  1|Allen, Miss Elisa...|   1st|29.0|female|       1|      1|
|  2|Allison, Miss Hel...|   1st| 2.0|female|       0|      1|
|  3|Allison, Mr Hudso...|   1st|30.0|  male|       0|      0|
|  4|Allison, Mrs Huds...|   1st|25.0|female|       0|      1|
|  5|Allison, Master H...|   1st|0.92|  male|       1|      0|
|  6|  Anderson, Mr Harry|   1st|47.0|  male|       1|      0|
|  7|Andrews, Miss Kor...|   1st|63.0|female|       1|      1|
|  8|Andrews, Mr Thoma...|   1st|39.0|  male|       0|      0|
|  9|Appleton, Mrs Edw...|   1st|58.0|female|       1|      1|
| 10|Artagaveytia, Mr ...|   1st|71.0|  male|       0|      0|
| 11|Astor, Colonel Jo...|   1st|47.0|  male|       0|      0|
| 12|Astor, Mrs John J...|   1st|19.0|female|       1|      1|
| 13|Aubert, Mrs Leont...|   1st| 0.0|female|       1|      1|
| 14|Barkworth, Mr Alg...|   1st| 0.0|  male|       1|      0|
| 15|  Baumann, Mr John D|   1st| 0.0|  male|       0|      0|
| 16|Baxter, Mrs James...|   1st|50.0|female|       1|      1|
| 17|Baxter, Mr Quigg ...|   1st|24.0|  male|       0|      0|
| 18| Beattie, Mr Thomson|   1st|36.0|  male|       0|      0|
| 19|Beckwith, Mr Rich...|   1st|37.0|  male|       1|      0|
| 20|Beckwith, Mrs Ric...|   1st|47.0|female|       1|      1|
+---+--------------------+------+----+------+--------+-------+
only showing top 20 rows

In [128]:
# Get the names of all males (IN)
t_joined_df.filter(t_joined_df.SexCode==0).select(t_joined_df.Name).show()

+--------------------+
|                Name|
+--------------------+
|Allison, Mr Hudso...|
|Allison, Master H...|
|  Anderson, Mr Harry|
|Andrews, Mr Thoma...|
|Artagaveytia, Mr ...|
|Astor, Colonel Jo...|
|Barkworth, Mr Alg...|
|  Baumann, Mr John D|
|Baxter, Mr Quigg ...|
| Beattie, Mr Thomson|
|Beckwith, Mr Rich...|
|Behr, Mr Karl Howell|
|  Birnbaum, Mr Jakob|
|Bishop, Mr Dickin...|
|Bjornstrm-Steffan...|
|Blackwell, Mr Ste...|
|     Blank, Mr Henry|
|Borebank, Mr John...|
|  Bradley, Mr George|
|Brady, Mr John Be...|
+--------------------+
only showing top 20 rows

In [145]:
t_joined.createOrReplaceTempView('t_joined_sql')

In [146]:
spark.sql("SELECT Name FROM t_joined_sql where sexcode == 0").show()

+--------------------+
|                Name|
+--------------------+
|Allison, Mr Hudso...|
|Allison, Master H...|
|  Anderson, Mr Harry|
|Andrews, Mr Thoma...|
|Artagaveytia, Mr ...|
|Astor, Colonel Jo...|
|Barkworth, Mr Alg...|
|  Baumann, Mr John D|
|Baxter, Mr Quigg ...|
| Beattie, Mr Thomson|
|Beckwith, Mr Rich...|
|Behr, Mr Karl Howell|
|  Birnbaum, Mr Jakob|
|Bishop, Mr Dickin...|
|Bjornstrm-Steffan...|
|Blackwell, Mr Ste...|
|     Blank, Mr Henry|
|Borebank, Mr John...|
|  Bradley, Mr George|
|Brady, Mr John Be...|
+--------------------+
only showing top 20 rows

In [150]:
# List people and their ages given their ages is more than the average age 
from pyspark.sql.functions import col, avg

spark.sql("select * from t_joined_sql where Age > (select avg(Age) from t_joined_sql)").show()

+---+--------------------+------+----+------+--------+-------+
| id|                Name|PClass| Age|   Sex|Survived|SexCode|
+---+--------------------+------+----+------+--------+-------+
|  1|Allen, Miss Elisa...|   1st|29.0|female|       1|      1|
|  3|Allison, Mr Hudso...|   1st|30.0|  male|       0|      0|
|  4|Allison, Mrs Huds...|   1st|25.0|female|       0|      1|
|  6|  Anderson, Mr Harry|   1st|47.0|  male|       1|      0|
|  7|Andrews, Miss Kor...|   1st|63.0|female|       1|      1|
|  8|Andrews, Mr Thoma...|   1st|39.0|  male|       0|      0|
|  9|Appleton, Mrs Edw...|   1st|58.0|female|       1|      1|
| 10|Artagaveytia, Mr ...|   1st|71.0|  male|       0|      0|
| 11|Astor, Colonel Jo...|   1st|47.0|  male|       0|      0|
| 12|Astor, Mrs John J...|   1st|19.0|female|       1|      1|
| 16|Baxter, Mrs James...|   1st|50.0|female|       1|      1|
| 17|Baxter, Mr Quigg ...|   1st|24.0|  male|       0|      0|
| 18| Beattie, Mr Thomson|   1st|36.0|  male|       0|      0|
| 19|Beckwith, Mr Rich...|   1st|37.0|  male|       1|      0|
| 20|Beckwith, Mrs Ric...|   1st|47.0|female|       1|      1|
| 21|Behr, Mr Karl Howell|   1st|26.0|  male|       1|      0|
| 22|  Birnbaum, Mr Jakob|   1st|25.0|  male|       0|      0|
| 23|Bishop, Mr Dickin...|   1st|25.0|  male|       1|      0|
| 24|Bishop, Mrs Dicki...|   1st|19.0|female|       1|      1|
| 25|Bjornstrm-Steffan...|   1st|28.0|  male|       1|      0|
+---+--------------------+------+----+------+--------+-------+
only showing top 20 rows

In [152]:
# Attach the names of people with the above result (use the id column to join)
t_data_with_names = spark.sql("select * from t_joined_sql where Age > (select avg(Age) from t_joined_sql)")

In [154]:
# Partition the data by columns
t_data_with_names.write.partitionBy("sex", "survived").parquet("data/titanic_part.parquet")

In [155]:
df_part = spark.read.parquet("data/titanic_part.parquet")

#### ----

In [162]:
# show the age, age groups (counts) ordered by age
spark.sql("select age, count(age) from t_joined_sql where age > 0 group by age order by age").show()

+----+----------+
| age|count(age)|
+----+----------+
|0.17|         1|
|0.33|         1|
| 0.8|         1|
|0.83|         2|
|0.92|         1|
| 1.0|         5|
| 1.5|         2|
| 2.0|         7|
| 3.0|         6|
| 4.0|         7|
| 5.0|         3|
| 6.0|         5|
| 7.0|         1|
| 8.0|         4|
| 9.0|         7|
|10.0|         2|
|11.0|         3|
|12.0|         2|
|13.0|         4|
|14.0|         4|
+----+----------+
only showing top 20 rows

In [165]:
# show the age, age groups (counts) ordered by age for different genders ordered by age
spark.sql("select age, sex, count(age) from t_joined_sql where age > 0 group by age,sex order by age").show()

+----+------+----------+
| age|   sex|count(age)|
+----+------+----------+
|0.17|female|         1|
|0.33|  male|         1|
| 0.8|  male|         1|
|0.83|  male|         2|
|0.92|  male|         1|
| 1.0|  male|         3|
| 1.0|female|         2|
| 1.5|female|         2|
| 2.0|  male|         3|
| 2.0|female|         4|
| 3.0|  male|         4|
| 3.0|female|         2|
| 4.0|  male|         3|
| 4.0|female|         4|
| 5.0|  male|         1|
| 5.0|female|         2|
| 6.0|  male|         3|
| 6.0|female|         2|
| 7.0|female|         1|
| 8.0|  male|         2|
+----+------+----------+
only showing top 20 rows

In [166]:
# show the age, age groups (counts) ordered by age for different genders ordered by gender then age
spark.sql("select age, sex, count(age) from t_joined_sql where age > 0 group by age,sex order by sex,age").show()

+----+------+----------+
| age|   sex|count(age)|
+----+------+----------+
|0.17|female|         1|
| 1.0|female|         2|
| 1.5|female|         2|
| 2.0|female|         4|
| 3.0|female|         2|
| 4.0|female|         4|
| 5.0|female|         2|
| 6.0|female|         2|
| 7.0|female|         1|
| 8.0|female|         2|
| 9.0|female|         3|
|10.0|female|         2|
|11.0|female|         1|
|12.0|female|         2|
|13.0|female|         1|
|14.0|female|         2|
|15.0|female|         4|
|16.0|female|         6|
|17.0|female|         7|
|18.0|female|        17|
+----+------+----------+
only showing top 20 rows

### Adding new records

In [170]:
from pyspark import Row
t_record_rdd = spark.sparkContext.parallelize([Row(id=0, Name="Jon Snow", PClass="2nd", Age=31.00, Sex="male", Survived=1, SexCode=0)])
t_record_rdd.collect()

[Row(Age=31.0, Name='Jon Snow', PClass='2nd', Sex='male', SexCode=0, Survived=1, id=0)]

In [171]:
t_record_df_unordered = t_record_rdd.toDF()
t_record_df_unordered.show()
t_record_df = t_record_df_unordered.select("id", "name", "pclass", "age", "sex", "survived", "sexcode")
t_record_df.show()

+----+--------+------+----+-------+--------+---+
| Age|    Name|PClass| Sex|SexCode|Survived| id|
+----+--------+------+----+-------+--------+---+
|31.0|Jon Snow|   2nd|male|      0|       1|  0|
+----+--------+------+----+-------+--------+---+

+---+--------+------+----+----+--------+-------+
| id|    name|pclass| age| sex|survived|sexcode|
+---+--------+------+----+----+--------+-------+
|  0|Jon Snow|   2nd|31.0|male|       1|      0|
+---+--------+------+----+----+--------+-------+

In [ ]:
# take a union of the above dataset with t_data_with_names

In [172]:
t_joined_df.show()

+---+--------------------+------+----+------+--------+-------+
| id|                Name|PClass| Age|   Sex|Survived|SexCode|
+---+--------------------+------+----+------+--------+-------+
|  1|Allen, Miss Elisa...|   1st|29.0|female|       1|      1|
|  2|Allison, Miss Hel...|   1st| 2.0|female|       0|      1|
|  3|Allison, Mr Hudso...|   1st|30.0|  male|       0|      0|
|  4|Allison, Mrs Huds...|   1st|25.0|female|       0|      1|
|  5|Allison, Master H...|   1st|0.92|  male|       1|      0|
|  6|  Anderson, Mr Harry|   1st|47.0|  male|       1|      0|
|  7|Andrews, Miss Kor...|   1st|63.0|female|       1|      1|
|  8|Andrews, Mr Thoma...|   1st|39.0|  male|       0|      0|
|  9|Appleton, Mrs Edw...|   1st|58.0|female|       1|      1|
| 10|Artagaveytia, Mr ...|   1st|71.0|  male|       0|      0|
| 11|Astor, Colonel Jo...|   1st|47.0|  male|       0|      0|
| 12|Astor, Mrs John J...|   1st|19.0|female|       1|      1|
| 13|Aubert, Mrs Leont...|   1st| 0.0|female|       1|      1|
| 14|Barkworth, Mr Alg...|   1st| 0.0|  male|       1|      0|
| 15|  Baumann, Mr John D|   1st| 0.0|  male|       0|      0|
| 16|Baxter, Mrs James...|   1st|50.0|female|       1|      1|
| 17|Baxter, Mr Quigg ...|   1st|24.0|  male|       0|      0|
| 18| Beattie, Mr Thomson|   1st|36.0|  male|       0|      0|
| 19|Beckwith, Mr Rich...|   1st|37.0|  male|       1|      0|
| 20|Beckwith, Mrs Ric...|   1st|47.0|female|       1|      1|
+---+--------------------+------+----+------+--------+-------+
only showing top 20 rows

In [173]:
t_record_df.union(t_joined_df).show()

+---+--------------------+------+----+------+--------+-------+
| id|                name|pclass| age|   sex|survived|sexcode|
+---+--------------------+------+----+------+--------+-------+
|  0|            Jon Snow|   2nd|31.0|  male|       1|      0|
|  1|Allen, Miss Elisa...|   1st|29.0|female|       1|      1|
|  2|Allison, Miss Hel...|   1st| 2.0|female|       0|      1|
|  3|Allison, Mr Hudso...|   1st|30.0|  male|       0|      0|
|  4|Allison, Mrs Huds...|   1st|25.0|female|       0|      1|
|  5|Allison, Master H...|   1st|0.92|  male|       1|      0|
|  6|  Anderson, Mr Harry|   1st|47.0|  male|       1|      0|
|  7|Andrews, Miss Kor...|   1st|63.0|female|       1|      1|
|  8|Andrews, Mr Thoma...|   1st|39.0|  male|       0|      0|
|  9|Appleton, Mrs Edw...|   1st|58.0|female|       1|      1|
| 10|Artagaveytia, Mr ...|   1st|71.0|  male|       0|      0|
| 11|Astor, Colonel Jo...|   1st|47.0|  male|       0|      0|
| 12|Astor, Mrs John J...|   1st|19.0|female|       1|      1|
| 13|Aubert, Mrs Leont...|   1st| 0.0|female|       1|      1|
| 14|Barkworth, Mr Alg...|   1st| 0.0|  male|       1|      0|
| 15|  Baumann, Mr John D|   1st| 0.0|  male|       0|      0|
| 16|Baxter, Mrs James...|   1st|50.0|female|       1|      1|
| 17|Baxter, Mr Quigg ...|   1st|24.0|  male|       0|      0|
| 18| Beattie, Mr Thomson|   1st|36.0|  male|       0|      0|
| 19|Beckwith, Mr Rich...|   1st|37.0|  male|       1|      0|
+---+--------------------+------+----+------+--------+-------+
only showing top 20 rows